In [15]:
import pandas as pd
import numpy as np

In [16]:
df = pd.read_csv(r'Inserte ruta aqui')

In [17]:
df.head(3)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S

In [18]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [19]:
df.dtypes
# Objeto en dtype se interpreta como string pero no se pueden utilizar los metodos de string

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [20]:
df["work_year"].describe()

count    3755.000000
mean     2022.373635
std         0.691448
min      2020.000000
25%      2022.000000
50%      2022.000000
75%      2023.000000
max      2023.000000
Name: work_year, dtype: float64

In [21]:
df.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [22]:
df.shape[0]

3755

In [23]:
# Esta funcion cuenta cuantas lineas hay duplicadas no cuantos valores
df.duplicated().sum()

np.int64(1171)

Eliminar los duplicados de este df

In [24]:
df = df.drop_duplicates()
df

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M
...,...,...,...,...,...,...,...,...,...,...,...
3750,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
3751,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
3752,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
3753,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
3754,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L

## EDA: 
#### Exploratory data analysis

Cual es el tipo de empleo que gana mas dinero?

In [25]:
df.groupby("job_title")['salary'].mean().head(5)

job_title
3D Computer Vision Researcher    120000.000000
AI Developer                     137181.818182
AI Programmer                     55000.000000
AI Scientist                     275312.500000
Analytics Engineer               149001.758242
Name: salary, dtype: float64

Dónde estan localizadas las compañias que más pagan?

In [26]:
df.groupby("company_location")["salary_in_usd"].mean().sort_values(ascending=False).head(5)

company_location
IL    271446.500000
PR    167500.000000
US    152374.791602
RU    140333.333333
CA    130572.759036
Name: salary_in_usd, dtype: float64

Cual es el empleo que permite mas trabajo remoto?

In [14]:
# calcula la media por cada job title, lo ordena de mayor a menor y muestro los 5 primeros
# ya que solo el primero no me parecia significativo en este dataframe porque tienen los mismos valores

df.groupby("job_title")["remote_ratio"].mean().sort_values(ascending=False).head(5)

job_title
BI Data Engineer             100.0
Cloud Database Engineer      100.0
Compliance Data Analyst      100.0
Data Analytics Consultant    100.0
Marketing Data Analyst       100.0
Name: remote_ratio, dtype: float64

Cual es el salario promedio de los empleados de Data Scientist?

In [27]:
df_scientists = df[df["job_title"] == "Data Scientist"]
media = df_scientists["salary_in_usd"].mean()
print(f"{media:.2f} USD")

132974.59 USD

Cuantas personas ganan por encima de los 200 000?

In [28]:
df[df["salary_in_usd"] > 200_000].shape[0]

376

Cual es el salario promedio de los empleados Data Modeler en SE?

In [36]:
df_data = df[(df["job_title"] == "Data Modeler") & (df["experience_level"] == "SE")]
medida = df_data["salary_in_usd"].mean()
print(f"El salario promedio de los empleados DM en SE es de {media:.2f} USD.")

El salario promedio de los empleados DM en SE es de 132974.59 USD

Para los ML Engineer, que diferencia de salario hay entre full time y part time?

In [48]:
PT = df[(df["job_title"] == "ML Engineer") & (df["employment_type"] == "FT")]
FT = df[(df["job_title"] == "ML Engineer") & (df["employment_type"] == "PT")]

salary_PT = PT["salary_in_usd"].mean()
salary_FT = FT["salary_in_usd"].mean()
dif = ((salary_FT - salary_PT) / salary_PT) * 100

print(f"En Part Time los trabajadores cobran {salary_PT} USD y  en Full Time los trabajadores cobran {salary_FT} USD lo cual indica una diferencia del {dif:.2f}% ")

En Part Time los trabajadores cobran 168083.9 USD y  en Full Time los trabajadores cobran 15966.0 USD lo cual indica una diferencia del -90.50%

Cual es el employment type mas frecuente entre los Business Data Analyst

In [49]:
df[df["job_title"] == "Data Analyst"]["employment_type"].mode()[0]

'FT'

En qué país, en cuanto a localización de la compañía, hay mayor ratio de teletrabajo?

In [52]:
df.groupby("company_location")["remote_ratio"].mean().sort_values(ascending=False).head(1)

company_location
AR    100.0
Name: remote_ratio, dtype: float64